name: "ResNet_ScasNet"

input: "data"
input_dim: 1
input_dim: 3
input_dim: 400
input_dim: 400


layer {
  name: "conv1_1_3x3_s2"
  type: "Convolution"
  bottom: "data"
  top: "conv1_1_3x3_s2"
  convolution_param {
    num_output: 64
       pad: 1
    kernel_size: 3
    stride: 2
    bias_term: false
  }
}
layer {
  name: "conv1_1_3x3_s2/bn"
  type: "BN"
  bottom: "conv1_1_3x3_s2"
  top: "conv1_1_3x3_s2"
   bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv1_1_3x3_s2/relu"
  type: "ReLU"
  bottom: "conv1_1_3x3_s2"
  top: "conv1_1_3x3_s2"
}
layer {
  name: "conv1_2_3x3"
  type: "Convolution"
  bottom: "conv1_1_3x3_s2"
  top: "conv1_2_3x3"
  convolution_param {
    num_output: 64
       pad: 1
    kernel_size: 3
    stride: 1
 bias_term: false
  }
}
layer {
  name: "conv1_2_3x3/bn"
  type: "BN"
  bottom: "conv1_2_3x3"
  top: "conv1_2_3x3"
   bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv1_2_3x3/relu"
  type: "ReLU"
  bottom: "conv1_2_3x3"
  top: "conv1_2_3x3"
}
layer {
  name: "conv1_3_3x3"
  type: "Convolution"
  bottom: "conv1_2_3x3"
  top: "conv1_3_3x3"
  convolution_param {
    num_output: 128
       pad: 1
    kernel_size: 3
    stride: 1
 bias_term: false
  }
}
layer {
  name: "conv1_3_3x3/bn"
  type: "BN"
  bottom: "conv1_3_3x3"
  top: "conv1_3_3x3"
   bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv1_3_3x3/relu"
  type: "ReLU"
  bottom: "conv1_3_3x3"
  top: "conv1_3_3x3"
}
layer {
  name: "pool1_3x3_s2"
  type: "Pooling"
  bottom: "conv1_3_3x3"
  top: "pool1_3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
       pad: 1
  }
}
layer {
  name: "conv2_1_1x1_reduce"
  type: "Convolution"
  bottom: "pool1_3x3_s2"
  top: "conv2_1_1x1_reduce"
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
 bias_term: false
  }
}
layer {
  name: "conv2_1_1x1_reduce/bn"
  type: "BN"
  bottom: "conv2_1_1x1_reduce"
  top: "conv2_1_1x1_reduce"
   bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv2_1_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv2_1_1x1_reduce"
  top: "conv2_1_1x1_reduce"
}
layer {
  name: "conv2_1_3x3"
  type: "Convolution"
  bottom: "conv2_1_1x1_reduce"
  top: "conv2_1_3x3"
  convolution_param {
    num_output: 64
       pad: 1
    kernel_size: 3
    stride: 1
 bias_term: false
  }
}
layer {
  name: "conv2_1_3x3/bn"
  type: "BN"
  bottom: "conv2_1_3x3"
  top: "conv2_1_3x3"
   bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv2_1_3x3/relu"
  type: "ReLU"
  bottom: "conv2_1_3x3"
  top: "conv2_1_3x3"
}
layer {
  name: "conv2_1_1x1_increase"
  type: "Convolution"
  bottom: "conv2_1_3x3"
  top: "conv2_1_1x1_increase"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
 bias_term: false
  }
}
layer {
  name: "conv2_1_1x1_increase/bn"
  type: "BN"
  bottom: "conv2_1_1x1_increase"
  top: "conv2_1_1x1_increase"
   bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv2_1_1x1_proj"
  type: "Convolution"
  bottom: "pool1_3x3_s2"
  top: "conv2_1_1x1_proj"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
 bias_term: false
  }
}
layer {
  name: "conv2_1_1x1_proj/bn"
  type: "BN"
  bottom: "conv2_1_1x1_proj"
  top: "conv2_1_1x1_proj"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv2_1"
  type: "Eltwise"
  bottom: "conv2_1_1x1_proj"
  bottom: "conv2_1_1x1_increase"
  top: "conv2_1"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv2_1/relu"
  type: "ReLU"
  bottom: "conv2_1"
  top: "conv2_1"
}
layer {
  name: "conv2_2_1x1_reduce"
  type: "Convolution"
  bottom: "conv2_1"
  top: "conv2_2_1x1_reduce"
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
 bias_term: false
  }
}
layer {
  name: "conv2_2_1x1_reduce/bn"
  type: "BN"
  bottom: "conv2_2_1x1_reduce"
  top: "conv2_2_1x1_reduce"
   bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv2_2_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv2_2_1x1_reduce"
  top: "conv2_2_1x1_reduce"
}
layer {
  name: "conv2_2_3x3"
  type: "Convolution"
  bottom: "conv2_2_1x1_reduce"
  top: "conv2_2_3x3"
  convolution_param {
    num_output: 64
       pad: 1
    kernel_size: 3
    stride: 1
 bias_term: false
  }
}
layer {
  name: "conv2_2_3x3/bn"
  type: "BN"
  bottom: "conv2_2_3x3"
  top: "conv2_2_3x3"
   bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv2_2_3x3/relu"
  type: "ReLU"
  bottom: "conv2_2_3x3"
  top: "conv2_2_3x3"
}
layer {
  name: "conv2_2_1x1_increase"
  type: "Convolution"
  bottom: "conv2_2_3x3"
  top: "conv2_2_1x1_increase"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
 bias_term: false
  }
}
layer {
  name: "conv2_2_1x1_increase/bn"
  type: "BN"
  bottom: "conv2_2_1x1_increase"
  top: "conv2_2_1x1_increase"
   bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv2_2"
  type: "Eltwise"
  bottom: "conv2_1"
  bottom: "conv2_2_1x1_increase"
  top: "conv2_2"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv2_2/relu"
  type: "ReLU"
  bottom: "conv2_2"
  top: "conv2_2"
}
layer {
  name: "conv2_3_1x1_reduce"
  type: "Convolution"
  bottom: "conv2_2"
  top: "conv2_3_1x1_reduce"
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
 bias_term: false
  }
}
layer {
  name: "conv2_3_1x1_reduce/bn"
  type: "BN"
  bottom: "conv2_3_1x1_reduce"
  top: "conv2_3_1x1_reduce"
   bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv2_3_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv2_3_1x1_reduce"
  top: "conv2_3_1x1_reduce"
}
layer {
  name: "conv2_3_3x3"
  type: "Convolution"
  bottom: "conv2_3_1x1_reduce"
  top: "conv2_3_3x3"
  convolution_param {
    num_output: 64
       pad: 1
    kernel_size: 3
    stride: 1
 bias_term: false
  }
}
layer {
  name: "conv2_3_3x3/bn"
  type: "BN"
  bottom: "conv2_3_3x3"
  top: "conv2_3_3x3"
   bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv2_3_3x3/relu"
  type: "ReLU"
  bottom: "conv2_3_3x3"
  top: "conv2_3_3x3"
}
layer {
  name: "conv2_3_1x1_increase"
  type: "Convolution"
  bottom: "conv2_3_3x3"
  top: "conv2_3_1x1_increase"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
 bias_term: false
  }
}
layer {
  name: "conv2_3_1x1_increase/bn"
  type: "BN"
  bottom: "conv2_3_1x1_increase"
  top: "conv2_3_1x1_increase"
   bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv2_3"
  type: "Eltwise"
  bottom: "conv2_2"
  bottom: "conv2_3_1x1_increase"
  top: "conv2_3"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv2_3/relu"
  type: "ReLU"
  bottom: "conv2_3"
  top: "conv2_3"
}
layer {
  name: "conv3_1_1x1_reduce"
  type: "Convolution"
  bottom: "conv2_3"
  top: "conv3_1_1x1_reduce"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
 bias_term: false
  }
}
layer {
  name: "conv3_1_1x1_reduce/bn"
  type: "BN"
  bottom: "conv3_1_1x1_reduce"
  top: "conv3_1_1x1_reduce"
   bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv3_1_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv3_1_1x1_reduce"
  top: "conv3_1_1x1_reduce"
}
layer {
  name: "conv3_1_3x3"
  type: "Convolution"
  bottom: "conv3_1_1x1_reduce"
  top: "conv3_1_3x3"
  convolution_param {
    num_output: 128
       pad: 1
    kernel_size: 3
    stride: 2
    bias_term: false
  }
}
layer {
  name: "conv3_1_3x3/bn"
  type: "BN"
  bottom: "conv3_1_3x3"
  top: "conv3_1_3x3"
   bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv3_1_3x3/relu"
  type: "ReLU"
  bottom: "conv3_1_3x3"
  top: "conv3_1_3x3"
}
layer {
  name: "conv3_1_1x1_increase"
  type: "Convolution"
  bottom: "conv3_1_3x3"
  top: "conv3_1_1x1_increase"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
 bias_term: false
  }
}
layer {
  name: "conv3_1_1x1_increase/bn"
  type: "BN"
  bottom: "conv3_1_1x1_increase"
  top: "conv3_1_1x1_increase"
   bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv3_1_1x1_proj"
  type: "Convolution"
  bottom: "conv2_3"
  top: "conv3_1_1x1_proj"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 2
    
    bias_term: false
  }
}
layer {
  name: "conv3_1_1x1_proj/bn"
  type: "BN"
  bottom: "conv3_1_1x1_proj"
  top: "conv3_1_1x1_proj"
   bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv3_1"
  type: "Eltwise"
  bottom: "conv3_1_1x1_proj"
  bottom: "conv3_1_1x1_increase"
  top: "conv3_1"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv3_1/relu"
  type: "ReLU"
  bottom: "conv3_1"
  top: "conv3_1"
}
layer {
  name: "conv3_2_1x1_reduce"
  type: "Convolution"
  bottom: "conv3_1"
  top: "conv3_2_1x1_reduce"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
 bias_term: false
  }
}
layer {
  name: "conv3_2_1x1_reduce/bn"
  type: "BN"
  bottom: "conv3_2_1x1_reduce"
  top: "conv3_2_1x1_reduce"
   bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv3_2_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv3_2_1x1_reduce"
  top: "conv3_2_1x1_reduce"
}
layer {
  name: "conv3_2_3x3"
  type: "Convolution"
  bottom: "conv3_2_1x1_reduce"
  top: "conv3_2_3x3"
  convolution_param {
    num_output: 128
       pad: 1
    kernel_size: 3
    stride: 1
 bias_term: false
  }
}
layer {
  name: "conv3_2_3x3/bn"
  type: "BN"
  bottom: "conv3_2_3x3"
  top: "conv3_2_3x3"
   bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv3_2_3x3/relu"
  type: "ReLU"
  bottom: "conv3_2_3x3"
  top: "conv3_2_3x3"
}
layer {
  name: "conv3_2_1x1_increase"
  type: "Convolution"
  bottom: "conv3_2_3x3"
  top: "conv3_2_1x1_increase"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
 bias_term: false
  }
}
layer {
  name: "conv3_2_1x1_increase/bn"
  type: "BN"
  bottom: "conv3_2_1x1_increase"
  top: "conv3_2_1x1_increase"
   bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv3_2"
  type: "Eltwise"
  bottom: "conv3_1"
  bottom: "conv3_2_1x1_increase"
  top: "conv3_2"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv3_2/relu"
  type: "ReLU"
  bottom: "conv3_2"
  top: "conv3_2"
}
layer {
  name: "conv3_3_1x1_reduce"
  type: "Convolution"
  bottom: "conv3_2"
  top: "conv3_3_1x1_reduce"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
 bias_term: false
  }
}
layer {
  name: "conv3_3_1x1_reduce/bn"
  type: "BN"
  bottom: "conv3_3_1x1_reduce"
  top: "conv3_3_1x1_reduce"
   bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv3_3_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv3_3_1x1_reduce"
  top: "conv3_3_1x1_reduce"
}
layer {
  name: "conv3_3_3x3"
  type: "Convolution"
  bottom: "conv3_3_1x1_reduce"
  top: "conv3_3_3x3"
  convolution_param {
    num_output: 128
       pad: 1
    kernel_size: 3
    stride: 1
 bias_term: false
  }
}
layer {
  name: "conv3_3_3x3/bn"
  type: "BN"
  bottom: "conv3_3_3x3"
  top: "conv3_3_3x3"
   bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv3_3_3x3/relu"
  type: "ReLU"
  bottom: "conv3_3_3x3"
  top: "conv3_3_3x3"
}
layer {
  name: "conv3_3_1x1_increase"
  type: "Convolution"
  bottom: "conv3_3_3x3"
  top: "conv3_3_1x1_increase"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv3_3_1x1_increase/bn"
  type: "BN"
  bottom: "conv3_3_1x1_increase"
  top: "conv3_3_1x1_increase"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv3_3"
  type: "Eltwise"
  bottom: "conv3_2"
  bottom: "conv3_3_1x1_increase"
  top: "conv3_3"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv3_3/relu"
  type: "ReLU"
  bottom: "conv3_3"
  top: "conv3_3"
}
layer {
  name: "conv3_4_1x1_reduce"
  type: "Convolution"
  bottom: "conv3_3"
  top: "conv3_4_1x1_reduce"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv3_4_1x1_reduce/bn"
  type: "BN"
  bottom: "conv3_4_1x1_reduce"
  top: "conv3_4_1x1_reduce"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv3_4_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv3_4_1x1_reduce"
  top: "conv3_4_1x1_reduce"
}
layer {
  name: "conv3_4_3x3"
  type: "Convolution"
  bottom: "conv3_4_1x1_reduce"
  top: "conv3_4_3x3"
  convolution_param {
    num_output: 128
       pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv3_4_3x3/bn"
  type: "BN"
  bottom: "conv3_4_3x3"
  top: "conv3_4_3x3"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv3_4_3x3/relu"
  type: "ReLU"
  bottom: "conv3_4_3x3"
  top: "conv3_4_3x3"
}
layer {
  name: "conv3_4_1x1_increase"
  type: "Convolution"
  bottom: "conv3_4_3x3"
  top: "conv3_4_1x1_increase"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv3_4_1x1_increase/bn"
  type: "BN"
  bottom: "conv3_4_1x1_increase"
  top: "conv3_4_1x1_increase"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv3_4"
  type: "Eltwise"
  bottom: "conv3_3"
  bottom: "conv3_4_1x1_increase"
  top: "conv3_4"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv3_4/relu"
  type: "ReLU"
  bottom: "conv3_4"
  top: "conv3_4"
}
layer {
  name: "conv4_1_1x1_reduce"
  type: "Convolution"
  bottom: "conv3_4"
  top: "conv4_1_1x1_reduce"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_1_1x1_reduce/bn"
  type: "BN"
  bottom: "conv4_1_1x1_reduce"
  top: "conv4_1_1x1_reduce"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_1_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv4_1_1x1_reduce"
  top: "conv4_1_1x1_reduce"
}
layer {
  name: "conv4_1_3x3"
  type: "Convolution"
  bottom: "conv4_1_1x1_reduce"
  top: "conv4_1_3x3"
  convolution_param {
    num_output: 256
    pad: 2
    dilation: 2
    kernel_size: 3
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_1_3x3/bn"
  type: "BN"
  bottom: "conv4_1_3x3"
  top: "conv4_1_3x3"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_1_3x3/relu"
  type: "ReLU"
  bottom: "conv4_1_3x3"
  top: "conv4_1_3x3"
}
layer {
  name: "conv4_1_1x1_increase"
  type: "Convolution"
  bottom: "conv4_1_3x3"
  top: "conv4_1_1x1_increase"
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_1_1x1_increase/bn"
  type: "BN"
  bottom: "conv4_1_1x1_increase"
  top: "conv4_1_1x1_increase"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_1_1x1_proj"
  type: "Convolution"
  bottom: "conv3_4"
  top: "conv4_1_1x1_proj"
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_1_1x1_proj/bn"
  type: "BN"
  bottom: "conv4_1_1x1_proj"
  top: "conv4_1_1x1_proj"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_1"
  type: "Eltwise"
  bottom: "conv4_1_1x1_proj"
  bottom: "conv4_1_1x1_increase"
  top: "conv4_1"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv4_1/relu"
  type: "ReLU"
  bottom: "conv4_1"
  top: "conv4_1"
}
layer {
  name: "conv4_2_1x1_reduce"
  type: "Convolution"
  bottom: "conv4_1"
  top: "conv4_2_1x1_reduce"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_2_1x1_reduce/bn"
  type: "BN"
  bottom: "conv4_2_1x1_reduce"
  top: "conv4_2_1x1_reduce"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_2_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv4_2_1x1_reduce"
  top: "conv4_2_1x1_reduce"
}
layer {
  name: "conv4_2_3x3"
  type: "Convolution"
  bottom: "conv4_2_1x1_reduce"
  top: "conv4_2_3x3"
  convolution_param {
    num_output: 256
    pad: 2
    dilation: 2
    kernel_size: 3
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_2_3x3/bn"
  type: "BN"
  bottom: "conv4_2_3x3"
  top: "conv4_2_3x3"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_2_3x3/relu"
  type: "ReLU"
  bottom: "conv4_2_3x3"
  top: "conv4_2_3x3"
}
layer {
  name: "conv4_2_1x1_increase"
  type: "Convolution"
  bottom: "conv4_2_3x3"
  top: "conv4_2_1x1_increase"
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_2_1x1_increase/bn"
  type: "BN"
  bottom: "conv4_2_1x1_increase"
  top: "conv4_2_1x1_increase"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_2"
  type: "Eltwise"
  bottom: "conv4_1"
  bottom: "conv4_2_1x1_increase"
  top: "conv4_2"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv4_2/relu"
  type: "ReLU"
  bottom: "conv4_2"
  top: "conv4_2"
}
layer {
  name: "conv4_3_1x1_reduce"
  type: "Convolution"
  bottom: "conv4_2"
  top: "conv4_3_1x1_reduce"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_3_1x1_reduce/bn"
  type: "BN"
  bottom: "conv4_3_1x1_reduce"
  top: "conv4_3_1x1_reduce"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_3_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv4_3_1x1_reduce"
  top: "conv4_3_1x1_reduce"
}
layer {
  name: "conv4_3_3x3"
  type: "Convolution"
  bottom: "conv4_3_1x1_reduce"
  top: "conv4_3_3x3"
  convolution_param {
    num_output: 256
    pad: 2
    dilation: 2
    kernel_size: 3
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_3_3x3/bn"
  type: "BN"
  bottom: "conv4_3_3x3"
  top: "conv4_3_3x3"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_3_3x3/relu"
  type: "ReLU"
  bottom: "conv4_3_3x3"
  top: "conv4_3_3x3"
}
layer {
  name: "conv4_3_1x1_increase"
  type: "Convolution"
  bottom: "conv4_3_3x3"
  top: "conv4_3_1x1_increase"
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_3_1x1_increase/bn"
  type: "BN"
  bottom: "conv4_3_1x1_increase"
  top: "conv4_3_1x1_increase"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_3"
  type: "Eltwise"
  bottom: "conv4_2"
  bottom: "conv4_3_1x1_increase"
  top: "conv4_3"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv4_3/relu"
  type: "ReLU"
  bottom: "conv4_3"
  top: "conv4_3"
}
layer {
  name: "conv4_4_1x1_reduce"
  type: "Convolution"
  bottom: "conv4_3"
  top: "conv4_4_1x1_reduce"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_4_1x1_reduce/bn"
  type: "BN"
  bottom: "conv4_4_1x1_reduce"
  top: "conv4_4_1x1_reduce"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_4_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv4_4_1x1_reduce"
  top: "conv4_4_1x1_reduce"
}
layer {
  name: "conv4_4_3x3"
  type: "Convolution"
  bottom: "conv4_4_1x1_reduce"
  top: "conv4_4_3x3"
  convolution_param {
    num_output: 256
    pad: 2
    dilation: 2
    kernel_size: 3
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_4_3x3/bn"
  type: "BN"
  bottom: "conv4_4_3x3"
  top: "conv4_4_3x3"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_4_3x3/relu"
  type: "ReLU"
  bottom: "conv4_4_3x3"
  top: "conv4_4_3x3"
}
layer {
  name: "conv4_4_1x1_increase"
  type: "Convolution"
  bottom: "conv4_4_3x3"
  top: "conv4_4_1x1_increase"
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_4_1x1_increase/bn"
  type: "BN"
  bottom: "conv4_4_1x1_increase"
  top: "conv4_4_1x1_increase"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_4"
  type: "Eltwise"
  bottom: "conv4_3"
  bottom: "conv4_4_1x1_increase"
  top: "conv4_4"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv4_4/relu"
  type: "ReLU"
  bottom: "conv4_4"
  top: "conv4_4"
}
layer {
  name: "conv4_5_1x1_reduce"
  type: "Convolution"
  bottom: "conv4_4"
  top: "conv4_5_1x1_reduce"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_5_1x1_reduce/bn"
  type: "BN"
  bottom: "conv4_5_1x1_reduce"
  top: "conv4_5_1x1_reduce"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_5_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv4_5_1x1_reduce"
  top: "conv4_5_1x1_reduce"
}
layer {
  name: "conv4_5_3x3"
  type: "Convolution"
  bottom: "conv4_5_1x1_reduce"
  top: "conv4_5_3x3"
  convolution_param {
    num_output: 256
    pad: 2
    dilation: 2
    kernel_size: 3
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_5_3x3/bn"
  type: "BN"
  bottom: "conv4_5_3x3"
  top: "conv4_5_3x3"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_5_3x3/relu"
  type: "ReLU"
  bottom: "conv4_5_3x3"
  top: "conv4_5_3x3"
}
layer {
  name: "conv4_5_1x1_increase"
  type: "Convolution"
  bottom: "conv4_5_3x3"
  top: "conv4_5_1x1_increase"
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_5_1x1_increase/bn"
  type: "BN"
  bottom: "conv4_5_1x1_increase"
  top: "conv4_5_1x1_increase"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_5"
  type: "Eltwise"
  bottom: "conv4_4"
  bottom: "conv4_5_1x1_increase"
  top: "conv4_5"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv4_5/relu"
  type: "ReLU"
  bottom: "conv4_5"
  top: "conv4_5"
}
layer {
  name: "conv4_6_1x1_reduce"
  type: "Convolution"
  bottom: "conv4_5"
  top: "conv4_6_1x1_reduce"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_6_1x1_reduce/bn"
  type: "BN"
  bottom: "conv4_6_1x1_reduce"
  top: "conv4_6_1x1_reduce"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_6_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv4_6_1x1_reduce"
  top: "conv4_6_1x1_reduce"
}
layer {
  name: "conv4_6_3x3"
  type: "Convolution"
  bottom: "conv4_6_1x1_reduce"
  top: "conv4_6_3x3"
  convolution_param {
    num_output: 256
    pad: 2
    dilation: 2
    kernel_size: 3
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_6_3x3/bn"
  type: "BN"
  bottom: "conv4_6_3x3"
  top: "conv4_6_3x3"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_6_3x3/relu"
  type: "ReLU"
  bottom: "conv4_6_3x3"
  top: "conv4_6_3x3"
}
layer {
  name: "conv4_6_1x1_increase"
  type: "Convolution"
  bottom: "conv4_6_3x3"
  top: "conv4_6_1x1_increase"
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_6_1x1_increase/bn"
  type: "BN"
  bottom: "conv4_6_1x1_increase"
  top: "conv4_6_1x1_increase"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_6"
  type: "Eltwise"
  bottom: "conv4_5"
  bottom: "conv4_6_1x1_increase"
  top: "conv4_6"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv4_6/relu"
  type: "ReLU"
  bottom: "conv4_6"
  top: "conv4_6"
}
layer {
  name: "conv4_7_1x1_reduce"
  type: "Convolution"
  bottom: "conv4_6"
  top: "conv4_7_1x1_reduce"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_7_1x1_reduce/bn"
  type: "BN"
  bottom: "conv4_7_1x1_reduce"
  top: "conv4_7_1x1_reduce"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_7_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv4_7_1x1_reduce"
  top: "conv4_7_1x1_reduce"
}
layer {
  name: "conv4_7_3x3"
  type: "Convolution"
  bottom: "conv4_7_1x1_reduce"
  top: "conv4_7_3x3"
  convolution_param {
    num_output: 256
    pad: 2
    dilation: 2
    kernel_size: 3
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_7_3x3/bn"
  type: "BN"
  bottom: "conv4_7_3x3"
  top: "conv4_7_3x3"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_7_3x3/relu"
  type: "ReLU"
  bottom: "conv4_7_3x3"
  top: "conv4_7_3x3"
}
layer {
  name: "conv4_7_1x1_increase"
  type: "Convolution"
  bottom: "conv4_7_3x3"
  top: "conv4_7_1x1_increase"
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_7_1x1_increase/bn"
  type: "BN"
  bottom: "conv4_7_1x1_increase"
  top: "conv4_7_1x1_increase"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_7"
  type: "Eltwise"
  bottom: "conv4_6"
  bottom: "conv4_7_1x1_increase"
  top: "conv4_7"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv4_7/relu"
  type: "ReLU"
  bottom: "conv4_7"
  top: "conv4_7"
}
layer {
  name: "conv4_8_1x1_reduce"
  type: "Convolution"
  bottom: "conv4_7"
  top: "conv4_8_1x1_reduce"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_8_1x1_reduce/bn"
  type: "BN"
  bottom: "conv4_8_1x1_reduce"
  top: "conv4_8_1x1_reduce"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_8_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv4_8_1x1_reduce"
  top: "conv4_8_1x1_reduce"
}
layer {
  name: "conv4_8_3x3"
  type: "Convolution"
  bottom: "conv4_8_1x1_reduce"
  top: "conv4_8_3x3"
  convolution_param {
    num_output: 256
    pad: 2
    dilation: 2
    kernel_size: 3
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_8_3x3/bn"
  type: "BN"
  bottom: "conv4_8_3x3"
  top: "conv4_8_3x3"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_8_3x3/relu"
  type: "ReLU"
  bottom: "conv4_8_3x3"
  top: "conv4_8_3x3"
}
layer {
  name: "conv4_8_1x1_increase"
  type: "Convolution"
  bottom: "conv4_8_3x3"
  top: "conv4_8_1x1_increase"
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_8_1x1_increase/bn"
  type: "BN"
  bottom: "conv4_8_1x1_increase"
  top: "conv4_8_1x1_increase"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_8"
  type: "Eltwise"
  bottom: "conv4_7"
  bottom: "conv4_8_1x1_increase"
  top: "conv4_8"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv4_8/relu"
  type: "ReLU"
  bottom: "conv4_8"
  top: "conv4_8"
}
layer {
  name: "conv4_9_1x1_reduce"
  type: "Convolution"
  bottom: "conv4_8"
  top: "conv4_9_1x1_reduce"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_9_1x1_reduce/bn"
  type: "BN"
  bottom: "conv4_9_1x1_reduce"
  top: "conv4_9_1x1_reduce"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_9_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv4_9_1x1_reduce"
  top: "conv4_9_1x1_reduce"
}
layer {
  name: "conv4_9_3x3"
  type: "Convolution"
  bottom: "conv4_9_1x1_reduce"
  top: "conv4_9_3x3"
  convolution_param {
    num_output: 256
    pad: 2
    dilation: 2
    kernel_size: 3
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_9_3x3/bn"
  type: "BN"
  bottom: "conv4_9_3x3"
  top: "conv4_9_3x3"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_9_3x3/relu"
  type: "ReLU"
  bottom: "conv4_9_3x3"
  top: "conv4_9_3x3"
}
layer {
  name: "conv4_9_1x1_increase"
  type: "Convolution"
  bottom: "conv4_9_3x3"
  top: "conv4_9_1x1_increase"
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_9_1x1_increase/bn"
  type: "BN"
  bottom: "conv4_9_1x1_increase"
  top: "conv4_9_1x1_increase"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_9"
  type: "Eltwise"
  bottom: "conv4_8"
  bottom: "conv4_9_1x1_increase"
  top: "conv4_9"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv4_9/relu"
  type: "ReLU"
  bottom: "conv4_9"
  top: "conv4_9"
}
layer {
  name: "conv4_10_1x1_reduce"
  type: "Convolution"
  bottom: "conv4_9"
  top: "conv4_10_1x1_reduce"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_10_1x1_reduce/bn"
  type: "BN"
  bottom: "conv4_10_1x1_reduce"
  top: "conv4_10_1x1_reduce"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_10_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv4_10_1x1_reduce"
  top: "conv4_10_1x1_reduce"
}
layer {
  name: "conv4_10_3x3"
  type: "Convolution"
  bottom: "conv4_10_1x1_reduce"
  top: "conv4_10_3x3"
  convolution_param {
    num_output: 256
    pad: 2
    dilation: 2
    kernel_size: 3
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_10_3x3/bn"
  type: "BN"
  bottom: "conv4_10_3x3"
  top: "conv4_10_3x3"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_10_3x3/relu"
  type: "ReLU"
  bottom: "conv4_10_3x3"
  top: "conv4_10_3x3"
}
layer {
  name: "conv4_10_1x1_increase"
  type: "Convolution"
  bottom: "conv4_10_3x3"
  top: "conv4_10_1x1_increase"
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_10_1x1_increase/bn"
  type: "BN"
  bottom: "conv4_10_1x1_increase"
  top: "conv4_10_1x1_increase"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_10"
  type: "Eltwise"
  bottom: "conv4_9"
  bottom: "conv4_10_1x1_increase"
  top: "conv4_10"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv4_10/relu"
  type: "ReLU"
  bottom: "conv4_10"
  top: "conv4_10"
}
layer {
  name: "conv4_11_1x1_reduce"
  type: "Convolution"
  bottom: "conv4_10"
  top: "conv4_11_1x1_reduce"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_11_1x1_reduce/bn"
  type: "BN"
  bottom: "conv4_11_1x1_reduce"
  top: "conv4_11_1x1_reduce"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_11_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv4_11_1x1_reduce"
  top: "conv4_11_1x1_reduce"
}
layer {
  name: "conv4_11_3x3"
  type: "Convolution"
  bottom: "conv4_11_1x1_reduce"
  top: "conv4_11_3x3"
  convolution_param {
    num_output: 256
    pad: 2
    dilation: 2
    kernel_size: 3
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_11_3x3/bn"
  type: "BN"
  bottom: "conv4_11_3x3"
  top: "conv4_11_3x3"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_11_3x3/relu"
  type: "ReLU"
  bottom: "conv4_11_3x3"
  top: "conv4_11_3x3"
}
layer {
  name: "conv4_11_1x1_increase"
  type: "Convolution"
  bottom: "conv4_11_3x3"
  top: "conv4_11_1x1_increase"
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_11_1x1_increase/bn"
  type: "BN"
  bottom: "conv4_11_1x1_increase"
  top: "conv4_11_1x1_increase"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_11"
  type: "Eltwise"
  bottom: "conv4_10"
  bottom: "conv4_11_1x1_increase"
  top: "conv4_11"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv4_11/relu"
  type: "ReLU"
  bottom: "conv4_11"
  top: "conv4_11"
}
layer {
  name: "conv4_12_1x1_reduce"
  type: "Convolution"
  bottom: "conv4_11"
  top: "conv4_12_1x1_reduce"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_12_1x1_reduce/bn"
  type: "BN"
  bottom: "conv4_12_1x1_reduce"
  top: "conv4_12_1x1_reduce"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_12_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv4_12_1x1_reduce"
  top: "conv4_12_1x1_reduce"
}
layer {
  name: "conv4_12_3x3"
  type: "Convolution"
  bottom: "conv4_12_1x1_reduce"
  top: "conv4_12_3x3"
  convolution_param {
    num_output: 256
    pad: 2
    dilation: 2
    kernel_size: 3
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_12_3x3/bn"
  type: "BN"
  bottom: "conv4_12_3x3"
  top: "conv4_12_3x3"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_12_3x3/relu"
  type: "ReLU"
  bottom: "conv4_12_3x3"
  top: "conv4_12_3x3"
}
layer {
  name: "conv4_12_1x1_increase"
  type: "Convolution"
  bottom: "conv4_12_3x3"
  top: "conv4_12_1x1_increase"
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_12_1x1_increase/bn"
  type: "BN"
  bottom: "conv4_12_1x1_increase"
  top: "conv4_12_1x1_increase"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_12"
  type: "Eltwise"
  bottom: "conv4_11"
  bottom: "conv4_12_1x1_increase"
  top: "conv4_12"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv4_12/relu"
  type: "ReLU"
  bottom: "conv4_12"
  top: "conv4_12"
}
layer {
  name: "conv4_13_1x1_reduce"
  type: "Convolution"
  bottom: "conv4_12"
  top: "conv4_13_1x1_reduce"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_13_1x1_reduce/bn"
  type: "BN"
  bottom: "conv4_13_1x1_reduce"
  top: "conv4_13_1x1_reduce"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_13_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv4_13_1x1_reduce"
  top: "conv4_13_1x1_reduce"
}
layer {
  name: "conv4_13_3x3"
  type: "Convolution"
  bottom: "conv4_13_1x1_reduce"
  top: "conv4_13_3x3"
  convolution_param {
    num_output: 256
    pad: 2
    dilation: 2
    kernel_size: 3
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_13_3x3/bn"
  type: "BN"
  bottom: "conv4_13_3x3"
  top: "conv4_13_3x3"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_13_3x3/relu"
  type: "ReLU"
  bottom: "conv4_13_3x3"
  top: "conv4_13_3x3"
}
layer {
  name: "conv4_13_1x1_increase"
  type: "Convolution"
  bottom: "conv4_13_3x3"
  top: "conv4_13_1x1_increase"
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_13_1x1_increase/bn"
  type: "BN"
  bottom: "conv4_13_1x1_increase"
  top: "conv4_13_1x1_increase"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_13"
  type: "Eltwise"
  bottom: "conv4_12"
  bottom: "conv4_13_1x1_increase"
  top: "conv4_13"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv4_13/relu"
  type: "ReLU"
  bottom: "conv4_13"
  top: "conv4_13"
}
layer {
  name: "conv4_14_1x1_reduce"
  type: "Convolution"
  bottom: "conv4_13"
  top: "conv4_14_1x1_reduce"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_14_1x1_reduce/bn"
  type: "BN"
  bottom: "conv4_14_1x1_reduce"
  top: "conv4_14_1x1_reduce"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_14_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv4_14_1x1_reduce"
  top: "conv4_14_1x1_reduce"
}
layer {
  name: "conv4_14_3x3"
  type: "Convolution"
  bottom: "conv4_14_1x1_reduce"
  top: "conv4_14_3x3"
  convolution_param {
    num_output: 256
    pad: 2
    dilation: 2
    kernel_size: 3
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_14_3x3/bn"
  type: "BN"
  bottom: "conv4_14_3x3"
  top: "conv4_14_3x3"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_14_3x3/relu"
  type: "ReLU"
  bottom: "conv4_14_3x3"
  top: "conv4_14_3x3"
}
layer {
  name: "conv4_14_1x1_increase"
  type: "Convolution"
  bottom: "conv4_14_3x3"
  top: "conv4_14_1x1_increase"
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_14_1x1_increase/bn"
  type: "BN"
  bottom: "conv4_14_1x1_increase"
  top: "conv4_14_1x1_increase"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_14"
  type: "Eltwise"
  bottom: "conv4_13"
  bottom: "conv4_14_1x1_increase"
  top: "conv4_14"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv4_14/relu"
  type: "ReLU"
  bottom: "conv4_14"
  top: "conv4_14"
}
layer {
  name: "conv4_15_1x1_reduce"
  type: "Convolution"
  bottom: "conv4_14"
  top: "conv4_15_1x1_reduce"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_15_1x1_reduce/bn"
  type: "BN"
  bottom: "conv4_15_1x1_reduce"
  top: "conv4_15_1x1_reduce"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_15_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv4_15_1x1_reduce"
  top: "conv4_15_1x1_reduce"
}
layer {
  name: "conv4_15_3x3"
  type: "Convolution"
  bottom: "conv4_15_1x1_reduce"
  top: "conv4_15_3x3"
  convolution_param {
    num_output: 256
    pad: 2
    dilation: 2
    kernel_size: 3
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_15_3x3/bn"
  type: "BN"
  bottom: "conv4_15_3x3"
  top: "conv4_15_3x3"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_15_3x3/relu"
  type: "ReLU"
  bottom: "conv4_15_3x3"
  top: "conv4_15_3x3"
}
layer {
  name: "conv4_15_1x1_increase"
  type: "Convolution"
  bottom: "conv4_15_3x3"
  top: "conv4_15_1x1_increase"
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_15_1x1_increase/bn"
  type: "BN"
  bottom: "conv4_15_1x1_increase"
  top: "conv4_15_1x1_increase"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_15"
  type: "Eltwise"
  bottom: "conv4_14"
  bottom: "conv4_15_1x1_increase"
  top: "conv4_15"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv4_15/relu"
  type: "ReLU"
  bottom: "conv4_15"
  top: "conv4_15"
}
layer {
  name: "conv4_16_1x1_reduce"
  type: "Convolution"
  bottom: "conv4_15"
  top: "conv4_16_1x1_reduce"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_16_1x1_reduce/bn"
  type: "BN"
  bottom: "conv4_16_1x1_reduce"
  top: "conv4_16_1x1_reduce"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_16_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv4_16_1x1_reduce"
  top: "conv4_16_1x1_reduce"
}
layer {
  name: "conv4_16_3x3"
  type: "Convolution"
  bottom: "conv4_16_1x1_reduce"
  top: "conv4_16_3x3"
  convolution_param {
    num_output: 256
    pad: 2
    dilation: 2
    kernel_size: 3
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_16_3x3/bn"
  type: "BN"
  bottom: "conv4_16_3x3"
  top: "conv4_16_3x3"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_16_3x3/relu"
  type: "ReLU"
  bottom: "conv4_16_3x3"
  top: "conv4_16_3x3"
}
layer {
  name: "conv4_16_1x1_increase"
  type: "Convolution"
  bottom: "conv4_16_3x3"
  top: "conv4_16_1x1_increase"
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_16_1x1_increase/bn"
  type: "BN"
  bottom: "conv4_16_1x1_increase"
  top: "conv4_16_1x1_increase"
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    frozen: true
    momentum: 0.95
  }
}
layer {
  name: "conv4_16"
  type: "Eltwise"
  bottom: "conv4_15"
  bottom: "conv4_16_1x1_increase"
  top: "conv4_16"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv4_16/relu"
  type: "ReLU"
  bottom: "conv4_16"
  top: "conv4_16"
}
layer {
  name: "conv4_17_1x1_reduce"
  type: "Convolution"
  bottom: "conv4_16"
  top: "conv4_17_1x1_reduce"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "conv4_17_1x1_reduce/bn"
  type: "BN"
  bottom: "conv4_17_1x1_reduce"
  top: "conv4_17_1x1_reduce"
